Repository: karthiknish/aroosi_swift
Catalog: lib/l10n/app_*.arb
Languages: ps

# appName
source: Aroosi
ps: اروسي

# tagline
source: Sacred Connections, Blessed Unions
ps: مقدس اتصالات، برکت وصلتونه

# onboardingWelcome
source: Welcome to Aroosi
ps: اروسي ته ښه راغلاست

# onboardingSubtitle
source: Find your perfect match through cultural harmony and family values
ps: ستاسو مناسب ملګری د کلتوري همغږۍ او د کورنۍ ارزښتونو له لارې ومومئ

# onboardingGetStarted
source: Get Started
ps: پيل وکړئ

# onboardingSkip
source: Skip
ps: پرېښودل

# profileCreateProfile
source: Create Profile
ps: پروفایل جوړ کړئ

# profileBasicInfo
source: Share Your Sacred Identity
ps: خپله مقدس هویت شريک کړئ

# profileLocation
source: Your Sacred Place on Earth
ps: ستاسو مقدس ځای پر ځمکه

# profilePhysical
source: Your Divine Attributes
ps: ستاسو الهی ځانګړنې

# profileProfessional
source: Your Path of Knowledge
ps: ستاسو د پوهې لاره

# profileCultural
source: Your Cultural Roots
ps: ستاسو کلتوري ریښې

# profileLifestyle
source: Your Heart's True Desires
ps: ستاسو د زړه ریښتیني غوښتنې

# profileAboutMe
source: About Me
ps: زما په اړه

# profilePhotos
source: Reflect Your Soul
ps: خپله روح منعکس کړئ

# profileReview
source: Complete Your Sacred Profile
ps: خپل مقدس پروفایل بشپړ کړئ

# profileFullName
source: Full Name
ps: بشپړ نوم

# profileDateOfBirth
source: Date of Birth
ps: د زیږون نیټه

# profileGender
source: Gender
ps: جنسیت

# profileLookingFor
source: Looking For
ps: لټون کوي

# profileReligion
source: Religion
ps: دین

# profileMotherTongue
source: Mother Tongue
ps: مورنۍ ژبه

# profileEthnicity
source: Ethnicity
ps: قوميت

# profileCity
source: City
ps: ښار

# profileCountry
source: Country
ps: هیواد

# profileHeight
source: Height
ps: قد

# profileMaritalStatus
source: Marital Status
ps: د واده وضعیت

# profileEducation
source: Education
ps: تحصیلات

# profileOccupation
source: Occupation
ps: دنده

# profileAnnualIncome
source: Annual Income
ps: کلنۍ عاید

# profilePhoneNumber
source: Phone Number
ps: د تلیفون شمیره

# profileDiet
source: Diet
ps: خواړه

# profileSmoking
source: Smoking
ps: سګرټ څښل

# profileDrinking
source: Drinking
ps: څښل

# profilePhysicalStatus
source: Physical Status
ps: فزیکي وضعیت

# profileFamilyRole
source: Family Role
ps: د کورنۍ رول

# profileFamilyValues
source: Family Values
ps: د کورنۍ ارزښتونه

# profileFamilyBackground
source: Family Background
ps: د کورنۍ شالید

# profileRequired
source: Required
ps: ضروري

# profileOptional
source: Optional
ps: اختیاري

# profileNext
source: Next
ps: بل

# profileBack
source: Back
ps: شاته

# profileSave
source: Save
ps: خوندي کړئ

# profileEdit
source: Edit
ps: سمول

# sacredCircleTitle
source: Family Sacred Circle
ps: د کورنۍ مقدس حلقه

# sacredCircleSubtitle
source: Connect families through traditional values and cultural harmony
ps: کورنۍ دودیزو ارزښتونو او کلتوري همغږۍ له لارې وصل کړئ

# sacredCircleFamiliesConnected
source: Families Connected
ps: نښلول شوې کورنۍ

# sacredCircleFamilyUnity
source: Unity
ps: یووالي

# sacredCircleCulturalHarmony
source: Cultural Harmony
ps: کلتوري همغږي

# sacredCircleRequestFamilyIntroduction
source: Request Family Introduction
ps: د کورنۍ معرفي غوښتنه

# sacredCircleBeginSupervisedCourtship
source: Begin Supervised Courtship
ps: د څارنې لاندې نامزدي پيل کړئ

# sacredCircleViewDetails
source: View Details
ps: جزئیات وګورئ

# sacredCircleSendBlessing
source: Send Blessing
ps: برکت ولېږئ

# compatibilityTitle
source: Compatibility Analysis
ps: د سازګارۍ تحلیل

# compatibilityAnalyzing
source: Analyzing compatibility...
ps: د سازګارۍ تحلیل کول...

# compatibilityNoData
source: No Compatibility Data
ps: د سازګارۍ معلومات نشته

# compatibilityOverall
source: Cultural Compatibility
ps: کلتوري سازګاري

# compatibilityExcellent
source: Excellent cultural harmony - strong foundation for a blessed union
ps: عالي کلتوري همغږي - د مبارک اتحادیې لپاره قوي بنسټ

# compatibilityGood
source: Good cultural compatibility with areas for understanding
ps: ښه کلتوري سازګاري د پوهیدو لپاره برخو سره

# compatibilityModerate
source: Moderate compatibility - open communication essential
ps: متوسط سازګاري - خلاص ارتباط ضروري دی

# compatibilityLow
source: Cultural differences may require significant adaptation
ps: کلتوري توپیرونه ممکن د پام وړ تطبیق ته اړتیا ولري

# compatibilityReligion
source: Religion
ps: دین

# compatibilityLanguage
source: Language
ps: ژبه

# compatibilityCulture
source: Culture
ps: کلتور

# compatibilityFamily
source: Family
ps: کورنۍ

# compatibilityInsights
source: AI Insights
ps: د AI بصیرتونه

# compatibilityRecommendations
source: Recommendations
ps: سپارښتنې

# compatibilityFamilyApproval
source: Request Family Approval
ps: د کورنۍ تایید غوښتنه

# compatibilitySupervisedConversation
source: Begin Supervised Courtship
ps: د څارنې لاندې نامزدي پيل کړئ

# familyApprovalTitle
source: Family Approval
ps: د کورنۍ تایید

# familyApprovalSent
source: Sent Requests
ps: لیږل شوي غوښتنې

# familyApprovalReceived
source: Received Requests
ps: ترلاسه شوي غوښتنې

# familyApprovalRequest
source: Request Family Introduction
ps: د کورنۍ معرفي غوښتنه

# familyApprovalRespond
source: Respond to Request
ps: غوښتنې ته ځواب ورکړئ

# familyApprovalApprove
source: Approve
ps: تایید

# familyApprovalDeny
source: Deny
ps: رد

# familyApprovalPending
source: Pending
ps: په انتظار کې

# familyApprovalApproved
source: Approved
ps: تایید شوی

# familyApprovalDenied
source: Denied
ps: رد شوی

# familyApprovalExpired
source: Expired
ps: انقضا شوی

# familyApprovalRelationship
source: Relationship
ps: اړیکه

# familyApprovalMessage
source: Message
ps: پیام

# familyApprovalResponseMessage
source: Response Message
ps: د ځواب پیغام

# settingsTitle
source: Settings
ps: تنظیمات

# settingsLanguage
source: Language
ps: ژبه

# settingsNotifications
source: Notifications
ps: خبرتیاوې

# settingsPrivacy
source: Privacy
ps: خصوصیت

# settingsHelp
source: Help & Support
ps: مرسته او ملاتړ

# settingsAbout
source: About Aroosi
ps: د اروسي په اړه

# settingsLogout
source: Logout
ps: وتل

# settingsDeleteAccount
source: Delete Account
ps: حساب حذف کړئ

# commonLoading
source: Loading...
ps: بارول...

# commonError
source: Error
ps: خطا

# commonRetry
source: Retry
ps: بیا هڅه

# commonCancel
source: Cancel
ps: لغوه کول

# commonOk
source: OK
ps: سمه ده

# commonYes
source: Yes
ps: هو

# commonNo
source: No
ps: نه

# commonSave
source: Save
ps: خوندي کړئ

# commonEdit
source: Edit
ps: سمول

# commonDelete
source: Delete
ps: حذفول

# commonShare
source: Share
ps: شریکول

# commonSearch
source: Search
ps: لټون

# commonFilter
source: Filter
ps: فلټر

# commonSort
source: Sort
ps: مرتبول

# commonRefresh
source: Refresh
ps: تازه کول

# commonClose
source: Close
ps: بندول

# errorsNetwork
source: Network error. Please check your connection.
ps: د شبکې خطا. مهرباني وکړئ خپل اتصال وګورئ.

# errorsServer
source: Server error. Please try again later.
ps: د سرور خطا. مهرباني وکړئ وروسته بیا هڅه وکړئ.

# errorsUnauthorized
source: Unauthorized. Please log in again.
ps: غیر مجاز. مهرباني وکړئ بیا ننوتئ.

# errorsNotFound
source: Not found.
ps: نه موندل شو.

# errorsGeneric
source: Something went wrong. Please try again.
ps: یو څه غلط شو. مهرباني وکړئ بیا هڅه وکړئ.

# validationRequired
source: This field is required
ps: دا ساحه ضروري ده

# validationInvalidEmail
source: Please enter a valid email address
ps: مهرباني وکړئ یو معتبر بریښنالیک آدرس داخل کړئ

# validationInvalidPhone
source: Please enter a valid phone number
ps: مهرباني وکړئ یو معتبر د تلیفون شمیره داخل کړئ

# validationTooShort
source: Too short
ps: ډیر لنډ

# validationTooLong
source: Too long
ps: ډیر اوږد

# validationInvalidFormat
source: Invalid format
ps: نامعتبر بڼه
